app/Controllers/EquiposController.php

    public function list(){
        $this->data['page_title'] = "Lista Equipos";
        $this->data['list'] = $this->crud_eq->orderBy('IdEquipo ASC')->select('*')->get()->getResult();
---
SELECT *
FROM `equipo`
ORDER BY `IdEquipo` ASC

    public function add(){
        $this->data['page_title'] = "Añadir Equipo";
        $this->crud_facu= new CrudFacultad();
        $this->data['lista_facultades'] = $this->crud_facu->orderBy('NomFacultad ASC')->select('*')->get()->getResult();
---
SELECT *
FROM `facultad`
ORDER BY `NomFacultad` ASC