app/Controllers/FacultadController.php

    public function list(){
        $this->data['page_title'] = "Lista Facultades";
        $this->data['list'] = $this->crud_facu->orderBy('IdFacultad ASC')->select('*')->get()->getResult();
---
SELECT *
FROM `facultad`
ORDER BY `IdFacultad` ASC