app/Controllers/InvestigadoresController.php

    public function add(){
        $this->data['page_title'] = "Añadir Investigadores";
        $this->crud_facu= new CrudFacultad();
        $this->data['lista_facultades'] = $this->crud_facu->orderBy('NomFacultad ASC')->select('*')->get()->getResult();
---
SELECT *
FROM `facultad`
ORDER BY `NomFacultad` ASC