app/Controllers/ReservasController.php

SELECT *
FROM `investigadores`
ORDER BY `DNI` ASC
SELECT *
FROM `equipo`
ORDER BY `IdEquipo` ASC
---
    public function add(){
        $this->data['page_title'] = "Añadir Reservas";
        $this->crud_invest= new CrudInvestigadores();
        $this->data['lista_invest'] = $this->crud_invest->orderBy('DNI ASC')->select('*')->get()->getResult();
        $this->crud_eq= new CrudEquipos();
        $this->data['lista_equipos'] = $this->crud_eq->orderBy('IdEquipo ASC')->select('*')->get()->getResult();

UPDATE `reservas` SET `DNI` = '23435343P', `IdEquipo` = 'U422', `FechaInicio` = '2023-05-22T12:32', `FechaFin` = '2005-10-29T00:00'
WHERE `IdReserva` = '16'
---
    public function upt(){
        $this->data['request'] = $this->request;
        $idres = $this->request->getPost('idres');
        $post = [
            'DNI' => $this->request->getPost('dni'),
            'IdEquipo' => $this->request->getPost('ideq'),
            'FechaInicio' => $this->request->getPost('fechaIni'),
            'FechaFin' => $this->request->getPost('fechaFin')
        ];
        $save = $this->crud_res->where('IdReserva',$idres)->set($post)->update();

SELECT *
FROM `reservas`
WHERE `IdReserva` = '16'
ORDER BY `IdReserva` ASC
 LIMIT 1
SELECT *
FROM `equipo`
ORDER BY `IdEquipo` ASC
SELECT *
FROM `investigadores`
ORDER BY `DNI` ASC
---
    public function edit($id=''){
        $this->data['page_title'] = "Editar Reserva";
        $qry=$this->crud_res->orderBy('IdReserva ASC')->select('*')->where(['IdReserva'=>$id]);
        $this->data['reserva'] = $qry->first();
        $this->crud_eq = new CrudEquipos();
        $this->data['lista_equipos']=$this->crud_eq->orderBy('IdEquipo ASC')->select('*')->get()->getResult();
        $this->crud_invest = new CrudInvestigadores();
        $this->data['lista_investigadores']=$this->crud_invest->orderBy('DNI ASC')->select('*')->get()->getResult();